References/ASTT/TestSuits/Tests/DeviceDiscovery/TC.DD.NVT.02/TC.DD.NVT.02_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">
  <soap:Header>
    <wsa:MessageID>urn:uuid:abb2cdc6-9bb4-4411-8e82-7441213ddc87</wsa:MessageID>
    <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
    <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
    <wsa:RelatesTo>uuid:82d5e4ab-c693-4a31-9479-19c83ebc6a8e</wsa:RelatesTo>
    <wsd:AppSequence InstanceId="1257872223" MessageNumber="3"/>
  </soap:Header>
  <soap:Body>
    <wsd:ProbeMatches>
      <wsd:ProbeMatch>
        <wsa:EndpointReference>
          <wsa:Address>uuid:67c66973-51ff-4aec-a9cd-baabf2fbe346</wsa:Address>
        </wsa:EndpointReference>
        <wsd:Types>dn:NetworkVideoTransmitter</wsd:Types>
        <wsd:XAddrs>192.168.10.42</wsd:XAddrs>
        <wsd:MetadataVersion>0</wsd:MetadataVersion>
      </wsd:ProbeMatch>
    </wsd:ProbeMatches>
  </soap:Body>
</soap:Envelope>
